trade_exp/src/DataProcessors/ПредпросмотрЧека/ПредпросмотрЧека.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="067ea3c0-f63e-440a-b2b8-ae65c9ec717e">
  <name>ПредпросмотрЧека</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

trade_exp/src/Enums/ВариантыОтправкиЭлектронногоЧекаПокупателю/ВариантыОтправкиЭлектронногоЧекаПокупателю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОтправкиЭлектронногоЧекаПокупателю</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОтправитьSMS</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеОтправлять</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтправитьEmail</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Бумажный</name>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыКартЛояльности/СтатусыКартЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыКартЛояльности</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f1baa0f1-c6c0-430d-90f6-7d9027b50b0a">
    <name>Аннулирована</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b6d3dd02-b8c3-47f2-a86f-e222d2841283">
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/КартыЛояльности/КартыЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КартыЛояльности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.ВидыКартЛояльности</owners>
  <attributes>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МагнитныйКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/ПредпросмотрЧека/Forms/Форма/Module.bsl
&НаСервере
&После("ПриСозданииНаСервере")
Процедура Док_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВариантЧека = ПолучитьВариантОтправки(Партнер); 
	ЭтотОбъект.ТипЧека = "Чек"; 	
КонецПроцедуры     

&НаСервере
Функция ПолучитьВариантОтправки(Партнер) 
	Если Партнер.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail Тогда 
		Возврат "Почта"; 
	ИначеЕсли Партнер.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьSMS Тогда 
		Возврат "Смс";
	ИначеЕсли Партнер.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.Бумажный Тогда
    	Возврат "Бумажный";
	Иначе
		Возврат "Бумажный"; 
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	ОбновитьВариантОтправки();
	
	ЭО = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте");
	Для каждого ДокументЧека из ДокументыЕдиногоЧека Цикл
		Если ТипЗнч(ДокументЧека.Документ) = ЭО и ЕдиныйЧек Тогда
			Сообщить("Чек будет пробит по безналичному расчету, для изменения снимите флаг ""Единый""");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
&Вместо("ПечатьЧека_Завершение")
Процедура Док_ПечатьЧека_Завершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		// +Альтерра
		Если АльтерраОбщегоНазначения.ЭтоЧастноеЛицо(Партнер) Тогда
		Попытка
			ТекстоваяСтрокаДляПечатиНаККТ = "";
			
			КартаЛояльностиПартнера = ПолучитьБонуснуюКартуЛояльности(Партнер);
			ИнформацияПоБонусам = БонусыАльтерра.ПолучитьИнформациюПоБаллам(ТекущаяДата(),Партнер, КартаЛояльностиПартнера);
			
			Если ЗначениеЗаполнено(Партнер) И  ЗначениеЗаполнено(КартаЛояльностиПартнера) И ЗначениеЗаполнено(ИнформацияПоБонусам) Тогда
				
				НакопленныеБаллы = ИнформацияПоБонусам.НакопленныеБаллы;
				ДоступныеБаллы = ИнформацияПоБонусам.ДоступныеБаллы;
				
				ТекстоваяСтрокаДляПечатиНаККТ = ТекстоваяСтрокаДляПечатиНаККТ + Символы.ПС + 
				СтрШаблон(НСтр("ru = 'Всего накоплено %1'"), ЧислоЦифрамиПредметИсчисленияПрописьюБонусы(НакопленныеБаллы)) + Символы.ПС;
				
				Если ПартнерБонуснаяПрограммаАктивна() Тогда
					ТекстоваяСтрокаДляПечатиНаККТ = ТекстоваяСтрокаДляПечатиНаККТ +	СтрШаблон(НСтр("ru = 'Доступно к использованию %1'"), ЧислоЦифрамиПредметИсчисленияПрописьюБонусы(ДоступныеБаллы)) + Символы.ПС;
				Иначе
					ТекстоваяСтрокаДляПечатиНаККТ = ТекстоваяСтрокаДляПечатиНаККТ + НСтр("ru = 'Активируйте бонусы на сайте'") + Символы.ПС +НСтр("ru = 'http://tg-alterra.ru/stroiklub/'") + Символы.ПС;
				КонецЕсли;
				
				ТекстоваяСтрокаДляПечатиНаККТ = ТекстоваяСтрокаДляПечатиНаККТ + Символы.ПС + НСтр("ru = 'Вы можете оплатить 99,9% своей покупки бонусами,'") + Символы.ПС + 
				НСтр("ru = '1 бонус = 1 рубль.'") + Символы.ПС + 
				НСтр("ru = 'Наши бонусы не сгорают.'");
				
				Если ЗначениеЗаполнено(ТекстоваяСтрокаДляПечатиНаККТ) Тогда
					
					МенеджерОборудованияКлиент.НачатьПечатьТекста(
					Новый ОписаниеОповещения("ПослеЗавершенияПечатиСлипЧека", ЭтотОбъект),
					УникальныйИдентификатор,
					ТекстоваяСтрокаДляПечатиНаККТ,
					ПараметрыККТ.ИдентификаторУстройства);
					
				КонецЕсли;
				
			КонецЕсли;
		Исключение
		КонецПопытки;
		КонецЕсли;
		// -
		
		ПараметрыФискализации = Неопределено;
		
		// Если данные в регистр ФискальныеОперации не были записаны - произошла ошибка при записи.
		Если РезультатВыполнения.Свойство("ВыходныеПараметры") И РезультатВыполнения.ВыходныеПараметры.Количество() > 8 Тогда
			ПараметрыФискализации = РезультатВыполнения.ВыходныеПараметры[8];
		КонецЕсли;
		
		ПараметрыЗавершения = Новый Структура;
		ПараметрыЗавершения.Вставить("ЗакрытьФорму",                Истина);
		ПараметрыЗавершения.Вставить("Форма",                       ЭтотОбъект);
		ПараметрыЗавершения.Вставить("ФискальнаяОперацияРеквизиты", ПараметрыФискализации);
		
		// в любом случае, даже при успешной записи, переходим к выполнению действий после записи 
		ПодключаемоеОборудованиеУТКлиент.ВыполнитьДействиеПослеЗаписиФискальнойОперацииВЖурнал(
			ЭтотОбъект,
			Новый ОписаниеОповещения("ФискальнаяОперацияЗаписанаВЖурнал", ПодключаемоеОборудованиеУТКлиент, ПараметрыЗавершения),
			НСтр("ru = 'Не удалось записать данные в журнал фискальных операций.'"));
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка.
		                            |Чек не напечатан на фискальном устройстве.
		                            |Дополнительное описание:
		                            |%ДополнительноеОписание%'");
		
		ТекстСообщения = СтрЗаменить(
			ТекстСообщения,
			"%ДополнительноеОписание%",
			РезультатВыполнения.ОписаниеОшибки);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		// Закрыть сессию проверки КМ на ККТ, если была открыта
		ЗакрытьСессиюПроверкиКМНаККТ(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияПечатиСлипЧека(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'При печати слип-чека возникла ошибка:
			           |""%1"".'"),
			РезультатВыполнения.ОписаниеОшибки);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПартнерБонуснаяПрограммаАктивна()
	
	Возврат Партнер.БонуснаяПрограммаАктивна;	
	
КонецФункции

&НаСервере
Функция ЧислоЦифрамиПредметИсчисленияПрописьюБонусы(БонусныеБаллы)
	
    Возврат СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(Цел(БонусныеБаллы),НСтр("ru = 'бонус, бонуса, бонусов'"));

КонецФункции

&НаСервере
Функция ПолучитьБонуснуюКартуЛояльности(Партнер) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартыЛояльности.Ссылка КАК Ссылка,
		|	КартыЛояльности.Партнер КАК Партнер,
		|	КартыЛояльности.Статус КАК Статус,
		|	КартыЛояльности.Соглашение КАК Соглашение
		|ИЗ
		|	Справочник.КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	КартыЛояльности.Партнер = &Партнер
		|	И КартыЛояльности.Статус = &Статус
    	|	И КартыЛояльности.Владелец = &Владелец";
 
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыКартЛояльности.Действует);
	Запрос.УстановитьПараметр("Владелец", Справочники.ВидыКартЛояльности.НайтиПоНаименованию("Бонусная карта"));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.КартыЛояльности.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура Док_ПробитьЧекВместо(Команда)   
	
	// -Альтерра
	//СтрокаВопроса = ""; 
	//ОчиститьСообщения();
	//
	//Если НЕ КорректноЗаполненыРеквизитыФормыДляПробитияЧека() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если ФормированиеФискальныхЧековВызовСервера.ПробитФискальныйЧекПоДокументу(ДокументСсылка) Тогда
	//	
	//	ПоказатьПредупреждение(
	//		Новый ОписаниеОповещения("ЗакрытьФормуПробитияЧека", ЭтотОбъект),
	//		НСтр("ru = 'По документу уже был пробит чек'"));
	//	
	//	Возврат;
	//	
	//КонецЕсли;
	//
	//Если НЕ ПерсональныеДанныеВведеныКорректно() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ОборудованиеТерминал) Тогда
	//	
	//	Если ПараметрыЭквайринговойОперации = Неопределено Тогда
	//		
	//		РозничныеПродажиКлиент.ОбработатьСостояниеСмены(
	//			ЭтотОбъект,
	//			Новый ОписаниеОповещения("ПослеОбработкиСостоянияСмены", ЭтотОбъект));
	//			
	//	Иначе
	//		
	//		ПараметрыОткрытияФормы = Новый Структура;
	//		ПараметрыОткрытияФормы.Вставить("ТипТранзакции",               ПараметрыЭквайринговойОперации.ТипТранзакции);
	//		ПараметрыОткрытияФормы.Вставить("Сумма",                       ПараметрыЭквайринговойОперации.Сумма);
	//		ПараметрыОткрытияФормы.Вставить("ПределСуммы",                 ПараметрыЭквайринговойОперации.Сумма);
	//		ПараметрыОткрытияФормы.Вставить("УказатьДополнительныеДанные", ПараметрыЭквайринговойОперации.ТипТранзакции = "AuthorizeRefund");
	//		
	//		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") Тогда
	//			ПараметрыОткрытияФормы.Вставить("ЗапретРедактированияСуммы", Истина);
	//		КонецЕсли;
	//		
	//		ОткрытьФорму(
	//			"Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ",
	//			ПараметрыОткрытияФормы,,,,,
	//			Новый ОписаниеОповещения(
	//				"ОплатитьКартойЗавершение",
	//				ЭтотОбъект,
	//				ПараметрыОткрытияФормы),
	//			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		
	//	КонецЕсли;
	//	
	//Иначе
	//	РозничныеПродажиКлиент.ОбработатьСостояниеСмены(
	//		ЭтотОбъект,
	//		Новый ОписаниеОповещения("ПослеОбработкиСостоянияСмены", ЭтотОбъект));
	//КонецЕсли;
	// -
	
	Если ВариантЧека = "Почта" Тогда
		Если Email <> "" Тогда 
			СтрокаВопроса = "Чек будет отправлен на почту: " + Email + ". Все верно?";
			РозничныеПродажиКлиентСервер.УстановитьВариантОтправкиЭлектронногоЧека(
				ЭтотОбъект,
				ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail"));
			Пробитие = Истина;
			ОборудованиеККТПриИзмененииНаСервере();  
		Иначе
			Сообщить("Введине EMAIL"); 
			Пробитие = Ложь;
		КонецЕсли;
		
	ИначеЕсли ВариантЧека = "Смс" Тогда	
		Если (СтрДлина(Телефон) = 14) Тогда 
			СтрокаВопроса = "Чек будет отправлен на телефон: " + Прав(Телефон, 4) + ". Все верно?";
			РозничныеПродажиКлиентСервер.УстановитьВариантОтправкиЭлектронногоЧека(
				ЭтотОбъект,
				ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьSMS")); 
			Пробитие = Истина;
			ОборудованиеККТПриИзмененииНаСервере();
		Иначе
			Сообщить("Введине Телефон!");
			Пробитие = Ложь;
		КонецЕсли;	
	ИначеЕсли ВариантЧека = "Бумажный" Тогда 	 
		РозничныеПродажиКлиентСервер.УстановитьВариантОтправкиЭлектронногоЧека(
			ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять"));
		СтрокаВопроса = "Чек будет напечатан. Все верно?";	
		Пробитие = Истина;
		ОборудованиеККТПриИзмененииНаСервере();
	ИначеЕсли ВариантЧека = "Фиктивный" Тогда 
	    Email = ПолучитьПочту();  
		РозничныеПродажиКлиентСервер.УстановитьВариантОтправкиЭлектронногоЧека(
			ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail"));
		СтрокаВопроса = "Покупатель отказался от чека. Все верно?"; 
		Пробитие = Истина;
		ОборудованиеККТПриИзмененииНаСервере();
	КонецЕсли; 	
	Если не пробитие  Тогда 
			Оповещение = Новый ОписаниеОповещения("ОтсутствуетКонтактнаяИнформация", ЭтотОбъект);    
	       	Кнопки = Новый СписокЗначений;
			Кнопки.Добавить("Ок", "Ок");
	      	Кнопки.Добавить("НеОтправлять", "Чек не нужен");
	 		ПоказатьВопрос(Оповещение,
		      	"Введите номер телефона или почту клиента!",
		      	Кнопки,
		      	0);  
	Иначе 
			Оповещение = Новый ОписаниеОповещения("ПредПробитие", ЭтотОбъект);    
	       	Кнопки = Новый СписокЗначений;
			Кнопки.Добавить("Ок", "Ок");
	      	Кнопки.Добавить("Отмена", "Отмена");
	 		ПоказатьВопрос(Оповещение,
		      	СтрокаВопроса,
		      	Кнопки,
		      	0);  
		
	КонецЕсли;  
КонецПроцедуры      

//Электронные чеки  

&НаКлиенте
Процедура ПредПробитие(Результат, Параметры) Экспорт
	Если Результат = "Ок" Тогда
    	ОчиститьСообщения();
		
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			
			ДокументОснование = ПолучитьДокументОснование(ДокументСсылка);
			
			ФискальнаяОперация = МенеджерОборудованияВызовСервера.ДанныеФискальнойОперации(ДокументОснование);
			
			Если ФискальнаяОперация = Неопределено И ТипЧека = "ЧекКоррекцииИсправлениеОшибки" Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'По документу-основанию ""%1"" необходимо предварительно пробить чек!'"),
					ДокументОснование
				);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ПерсональныеДанныеВведеныКорректно() Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОборудованиеТерминал) Тогда
			
			Если ПараметрыЭквайринговойОперации = Неопределено Тогда
				
				РозничныеПродажиКлиент.ОбработатьСостояниеСмены(
					ЭтотОбъект,
					Новый ОписаниеОповещения("ПослеОбработкиСостоянияСмены", ЭтотОбъект));
					
			Иначе
				
				ПараметрыОткрытияФормы = Новый Структура;
				ПараметрыОткрытияФормы.Вставить("ТипТранзакции",               ПараметрыЭквайринговойОперации.ТипТранзакции);
				ПараметрыОткрытияФормы.Вставить("Сумма",                       ПараметрыЭквайринговойОперации.Сумма);
				ПараметрыОткрытияФормы.Вставить("ПределСуммы",                 ПараметрыЭквайринговойОперации.Сумма);
				ПараметрыОткрытияФормы.Вставить("УказатьДополнительныеДанные", ПараметрыЭквайринговойОперации.ТипТранзакции = "AuthorizeRefund");
				
				Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") Тогда
					ПараметрыОткрытияФормы.Вставить("ЗапретРедактированияСуммы", Истина);
				КонецЕсли;
				
				ОткрытьФорму(
					"Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ",
					ПараметрыОткрытияФормы,,,,,
					Новый ОписаниеОповещения(
						"ОплатитьКартойЗавершение",
						ЭтотОбъект,
						ПараметрыОткрытияФормы),
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			КонецЕсли;
			
		Иначе
			РозничныеПродажиКлиент.ОбработатьСостояниеСмены(
				ЭтотОбъект,
				Новый ОписаниеОповещения("ПослеОбработкиСостоянияСмены", ЭтотОбъект));
		КонецЕсли;
		
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура Док_НапечататьЧекВместо(Команда)
    ВариантЧека = "Бумажный"; 
	ОбновитьВариантОтправки();
КонецПроцедуры
	  

&НаКлиенте
Процедура Док_ЭлектронныйЧекНеТребуетсяПосле(Команда)
 	ВариантЧека = "Фиктивный"; 
	ОбновитьВариантОтправки();
КонецПроцедуры   

&НаСервере 
Функция ПолучитьПочту(); 
    
	Возврат АльтерраОбщегоНазначения.ПолучитьПочтуДляОтправкиЧеков(ДокументСсылка.организация);

	КонецФУнкции 

&НаКлиенте
Процедура ОтсутствуетКонтактнаяИнформация(Результат, Параметры) Экспорт
	Если Результат = "НеОтправлять" Тогда
	    ВариантЧека = "Фиктивный"; 
		ОбновитьВариантОтправки();	
	КонецЕсли;             
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВариантОтправки() 
    Если ВариантЧека = "Почта" Тогда  
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Истина;  
		ОтправкаНаСмс = Ложь; 
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Оранжевый;
		
	ИначеЕсли ВариантЧека = "Смс" Тогда 
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Истина;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Оранжевый;
		Элементы.Телефон.ЦветФона = WebЦвета.Оранжевый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	ИначеЕсли ВариантЧека = "Бумажный" Тогда 
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Оранжевый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Белый;
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Ложь;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	ИначеЕсли ВариантЧека = "Фиктивный" Тогда 	 
		Элементы.ФормаЭлектронныйЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаНапечататьЧек.ЦветФона = WebЦвета.Белый;
		Элементы.ФормаЭлектронныйЧекНеТребуется.ЦветФона = WebЦвета.Оранжевый; 
		ОтправкаНаПочту = Ложь;  
		ОтправкаНаСмс = Ложь;
		Элементы.ОтправкаНаПочту.ЦветФона = WebЦвета.Белый;
		Элементы.ОтправкаНаСмс.ЦветФона = WebЦвета.Белый;
		Элементы.Телефон.ЦветФона = WebЦвета.Белый;
		Элементы.Email.ЦветФона = WebЦвета.Белый;

	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Док_ОтправкаНаСмсПриИзмененииВместо(Элемент)
	ОтправкаНаПочту = не ОтправкаНаСМС; 
	Если ОтправкаНаПочту Тогда 
		ВариантЧека = "Почта"; 
	ИначеЕсли ОтправкаНаСмс Тогда 
		ВариантЧека = "Смс"; 
	КонецЕсли;   
	ОбновитьВариантОтправки(); 
КонецПроцедуры

&НаКлиенте
Процедура Док_ОтправкаНаПочтуПриИзмененииВместо(Элемент)
	ОтправкаНаСМС = не ОтправкаНаПочту; 
	Если ОтправкаНаПочту Тогда 
		ВариантЧека = "Почта"; 
	ИначеЕсли ОтправкаНаСмс Тогда 
		ВариантЧека = "Смс"; 
	КонецЕсли; 
   	ОбновитьВариантОтправки();
КонецПроцедуры

#Область НапечататьПоследнийСлипЧек

&НаКлиенте
Процедура НапечататьПоследнийСлипЧек(Команда)   
	ДопМодульКлиент.НапечататьПоследнийСлипЧек(ЭтотОбъект.УникальныйИдентификатор, ОборудованиеККТ);
КонецПроцедуры        

#КонецОбласти
